using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WpfApp04
{
    public class TrafficSignal : TrackObject
    {
        public double DicTrafficSignalKindID;

        public static readonly Dictionary<double, string> trafficSignalNames = new()
        {
            [1] = "Газ",
            [2] = "Нефть",
            [3] = "Начало карстоопасного участка",
            [4] = "Конец карстоопасного участка",
            [5] = "НТ",
            [6] = "КТ 33",
            [7] = "КТ 28",
            [8] = "Внимание! Токораздел",
            [9] = "Поднять токоприемник",
            [10] = "Начало нейтральной вставки",
            [11] = "Конец нейтральной вставки",
            [12] = "Предельный столбик",
            [13] = "Граница станции",
            [14] = "Начало опасного места",
            [15] = "Конец опасного места",
            [16] = "Подача свистка",
            [17] = "Остановка локомотива",
            [18] = "Отключить ток",
            [19] = "Включить ток на электровозе",
            [20] = "Включить ток на электропоезде",
            [21] = "Конец контактной подвески",
            [22] = "Остановка первого вагона",
            [23] = "КТ 55",
            [24] = "КТ",
            [25] = "Опустить токоприемник",
            [26] = "Начало воздушного промежутка",
            [27] = "Конец воздушного промежутка",
            [28] = "Желтый щит",
            [29] = "Зеленый щит",
            [30] = "Желтый диск",
            [31] = "Зеленый диск"
        };

        public TrafficSignal()
        {
            this.Start = new PointOnTrack();
            this.End = new PointOnTrack();
        }

    }
}
